# Basic Pandas Operations

In [1]:
import numpy as np
import pandas as pd

In [2]:
#create a dictionary
data = {
    'dogs' : [23,17,5,12,1,5],
    'birds' : [10,7,13,2,8,19],
    'cats' : [4,14,8,15,11,3]
}

In [3]:
#view the dictionary data
data

{'dogs': [23, 17, 5, 12, 1, 5],
 'birds': [10, 7, 13, 2, 8, 19],
 'cats': [4, 14, 8, 15, 11, 3]}

In [4]:
# convert the dictionary into a dataframe
data_df = pd.DataFrame(data)

In [5]:
# display the dataframe
data_df

   dogs  birds  cats
0    23     10     4
1    17      7    14
2     5     13     8
3    12      2    15
4     1      8    11
5     5     19     3

In [6]:
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
dogs     6 non-null int64
birds    6 non-null int64
cats     6 non-null int64
dtypes: int64(3)
memory usage: 224.0 bytes

In [7]:
data_df.head(n=3)

   dogs  birds  cats
0    23     10     4
1    17      7    14
2     5     13     8

In [8]:
data_df.tail()

   dogs  birds  cats
1    17      7    14
2     5     13     8
3    12      2    15
4     1      8    11
5     5     19     3

In [9]:
# add index names
idx_names = ['shelter0','shelter1','shelter2','shelter3','shelter4','shelter5']
named_data_df = pd.DataFrame(data,index=idx_names)
named_data_df

          dogs  birds  cats
shelter0    23     10     4
shelter1    17      7    14
shelter2     5     13     8
shelter3    12      2    15
shelter4     1      8    11
shelter5     5     19     3

# Working with Rows and Columns

In [10]:
# select row only using loc
named_data_df.loc["shelter3"]

dogs     12
birds     2
cats     15
Name: shelter3, dtype: int64

In [11]:
named_data_df.loc["shelter3","birds"]

2

In [13]:
# Slice by row using index positions
named_data_df[2:5]

          dogs  birds  cats
shelter2     5     13     8
shelter3    12      2    15
shelter4     1      8    11

In [14]:
# slice by row using label names
named_data_df["shelter2":"shelter5"]

          dogs  birds  cats
shelter2     5     13     8
shelter3    12      2    15
shelter4     1      8    11
shelter5     5     19     3

In [16]:
named_data_df.iloc[:,1]

shelter0    10
shelter1     7
shelter2    13
shelter3     2
shelter4     8
shelter5    19
Name: birds, dtype: int64

In [17]:
named_data_df.iloc[2:5,0:2]

          dogs  birds
shelter2     5     13
shelter3    12      2
shelter4     1      8

In [18]:
named_data_df.dogs

shelter0    23
shelter1    17
shelter2     5
shelter3    12
shelter4     1
shelter5     5
Name: dogs, dtype: int64

In [19]:
named_data_df["dogs"]

shelter0    23
shelter1    17
shelter2     5
shelter3    12
shelter4     1
shelter5     5
Name: dogs, dtype: int64

In [21]:
named_data_df[["dogs","cats"]]

          dogs  cats
shelter0    23     4
shelter1    17    14
shelter2     5     8
shelter3    12    15
shelter4     1    11
shelter5     5     3

In [22]:
# know the columns
named_data_df.columns

Index(['dogs', 'birds', 'cats'], dtype='object')

In [24]:
# sorting
named_data_df.sort_values(by='cats')

          dogs  birds  cats
shelter5     5     19     3
shelter0    23     10     4
shelter2     5     13     8
shelter4     1      8    11
shelter1    17      7    14
shelter3    12      2    15

In [25]:
# summary statistics
named_data_df.describe()

           dogs      birds       cats
count   6.00000   6.000000   6.000000
mean   10.50000   9.833333   9.166667
std     8.38451   5.776389   5.036533
min     1.00000   2.000000   3.000000
25%     5.00000   7.250000   5.000000
50%     8.50000   9.000000   9.500000
75%    15.75000  12.250000  13.250000
max    23.00000  19.000000  15.000000

In [26]:
named_data_df.T

       shelter0  shelter1  shelter2  shelter3  shelter4  shelter5
dogs         23        17         5        12         1         5
birds        10         7        13         2         8        19
cats          4        14         8        15        11         3